# a = {"a":1,"b":2}
# print(a.get("c"))
# print(bool(a.get("c")))

# my_str = """1.油漆渣转移1500吨至四川纳海环境有限公司（川环危第510603060号）
# 2.废活性炭转移100吨至川纳海环境有限公司（川环危第510603060号）
# 3.油漆桶转移150吨至四川西部聚鑫化工包装有限公司（川环危 510112047号）
# 4.含漆废物转移5吨至川纳海环境有限公司（川环危第510603060号）
# 5.污泥转移50吨至川纳海环境有限公司（川环危第510603060号）"""
#
# my_str2 = my_str.replace(" ", "")
# my_str3 = my_str2.replace("\n", "")
# print(my_str3)
import datetime
import xlwt

a = [{'车牌号': '川AX8199', '所属运企': '成都启阳运输有限公司', '实例名称': 'esr冷链电商产业园项目', '告警地址': '四川省成都市青白江区城厢镇大石路',
      '告警时间': datetime.datetime(2021, 11, 16, 4, 0), '电子联单': '202111150405'},
     {'车牌号': '川AX5023', '所属运企': '成都市勇达物流有限公司', '实例名称': '城厢镇新增国际集装箱功能区工程', '告警地址': ' 四川省成都市青白江区城厢镇东方渡，疑似消纳（青白江区桂花桥附近）',
      '告警时间': datetime.datetime(2021, 11, 16, 2, 0), '电子联单': '202111150366'},
     {'车牌号': '川AW7153', '所属运企': '成都市昌顺物流有限公司', '实例名称': '宏源砂石场', '告警地址': '四川省成都市青白江区同济大道',
      '告警时间': datetime.datetime(2021, 11, 16, 2, 0), '电子联单': '202111150354'},
     {'车牌号': '川AW7153', '所属运企': '成都市昌顺物流有限公司', '实例名称': '宏源砂石场', '告警地址': '四川省成都市青白江区同济大道',
      '告警时间': datetime.datetime(2021, 11, 16, 2, 0), '电子联单': '202111150346'},
     {'车牌号': '川AW7153', '所属运企': '成都市昌顺物流有限公司', '实例名称': '宏源砂石场', '告警地址': '四川省成都市青白江区同济大道',
      '告警时间': datetime.datetime(2021, 11, 16, 1, 0), '电子联单': '202111150334'},
     {'车牌号': '川AW7153', '所属运企': '成都市昌顺物流有限公司', '实例名称': '宏源砂石场', '告警地址': '四川省成都市青白江区同济大道',
      '告警时间': datetime.datetime(2021, 11, 16, 1, 0), '电子联单': '202111150332'},
     {'车牌号': '川AW7153', '所属运企': '成都市昌顺物流有限公司', '实例名称': '宏源砂石场', '告警地址': '四川省成都市青白江区同济大道',
      '告警时间': datetime.datetime(2021, 11, 16, 1, 0), '电子联单': '202111150326'},
     {'车牌号': '川AW7153', '所属运企': '成都市昌顺物流有限公司', '实例名称': '宏源砂石场', '告警地址': '四川省成都市青白江区同济大道',
      '告警时间': datetime.datetime(2021, 11, 16, 1, 0), '电子联单': '202111150315'},
     {'车牌号': '川AAD209', '所属运企': '成都顺展鸿途物流有限公司', '实例名称': '新增国际集装箱功能区二期', '告警地址': ' 111111 地址： 四川省成都市青白江区城厢镇桂红路7号 ',
      '告警时间': datetime.datetime(2021, 11, 16, 1, 0), '电子联单': '202111150313'},
     {'车牌号': '川AW7153', '所属运企': '成都市昌顺物流有限公司', '实例名称': '宏源砂石场', '告警地址': '四川省成都市青白江区同济大道',
      '告警时间': datetime.datetime(2021, 11, 16, 1, 0), '电子联单': '202111150311'},
     {'车牌号': '川AW7153', '所属运企': '成都市昌顺物流有限公司', '实例名称': '宏源砂石场', '告警地址': '四川省成都市青白江区同济大道',
      '告警时间': datetime.datetime(2021, 11, 16, 0, 0), '电子联单': '202111150291'},
     {'车牌号': '川AW7153', '所属运企': '成都市昌顺物流有限公司', '实例名称': '宏源砂石场', '告警地址': '四川省成都市青白江区同济大道',
      '告警时间': datetime.datetime(2021, 11, 16, 0, 0), '电子联单': '202111150285'},
     {'车牌号': '川AW7153', '所属运企': '成都市昌顺物流有限公司', '实例名称': '宏源砂石场', '告警地址': '四川省成都市青白江区同济大道',
      '告警时间': datetime.datetime(2021, 11, 16, 0, 0), '电子联单': '202111150277'},
     {'车牌号': '川AW7153', '所属运企': '成都市昌顺物流有限公司', '实例名称': '宏源砂石场', '告警地址': '四川省成都市青白江区同济大道',
      '告警时间': datetime.datetime(2021, 11, 16, 0, 0), '电子联单': '202111150262'}]
count = 1
for i in a:
    print(i)
    for j in i.values():
        print(j)
        count += 1
        print(count)

workbook = xlwt.Workbook(encoding='utf-8')
face_mask = workbook.add_sheet('sheet1')

print(datetime.datetime(2021, 11, 9, 16, 51, 13))
